# -*- coding: utf-8 -*-
'''
Задание 5.1

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.
'''

ip_input = input('Введите IP адрес: ')
ip, mask = ip_input.split('/')
oct1, oct2, oct3, oct4 = ip.split('.')
# вычисляем маску в бинарном виде
binmask = str('1')*int(mask)+(32-int(mask))*str(0)

# разделяем маску по октетам
mask1, mask2, mask3, mask4 = binmask[0:8],binmask[8:16],binmask[16:24],binmask[24:]

templ = '''
Network:
{0:<8} {1:<8} {2:<8} {3:<8}
{0:08b} {1:08b} {2:08b} {3:08b}

Mask:
/{4}
{5:<8} {6:<8} {7:<8} {8:<8}
{5:08b} {6:08b} {7:08b} {8:08b}
'''
print(templ.format(int(oct1), int(oct2), int(oct3), 0, int(mask), int(mask1, 2), int(mask2, 2), int(mask3, 2), int(mask4, 2)))
